fanmuzhi/STM32_ARM/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#pragma pack(8)
#include "usbd_cdc.h"
#include "usbd_cdc_if.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;

I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi5;

TIM_HandleTypeDef htim10;
TIM_HandleTypeDef htim11;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

typedef struct{	GPIO_TypeDef 		*gpio_x;
								uint16_t				gpio_pin;
}Gpio_RGB_Led_t;

typedef struct{	TIM_HandleTypeDef		*tim_handle;
								uint32_t						tim_channel;
								uint16_t						tim_isStarted;
								uint16_t						last_led_tim_val;
}Timer_Led_t;

typedef struct{	uint16_t						result_dn;
								uint16_t						gaugeMinScale;
								ADC_HandleTypeDef		*gauge_handle;
}Lightness_Gauge_t;

typedef struct{	uint32_t	error_LightW;
								uint32_t	error_LightIR;
								uint16_t	lightnessWDN;
								uint16_t	lightnessIRDN;
}VCP_Light_Reply_t;

typedef struct{	uint32_t	error;
								uint16_t	lightnessDN;
}VCP_SetLed_Reply_t;

Timer_Led_t led_W		= {	.tim_handle				= &htim10, 
												.tim_channel			= TIM_CHANNEL_1, 
												.tim_isStarted			= 0, 
												.last_led_tim_val	= 0};

Timer_Led_t led_IR	= {	.tim_handle				= &htim11, 
												.tim_channel			= TIM_CHANNEL_1, 
												.tim_isStarted			= 0, 
												.last_led_tim_val	= 0 };

Lightness_Gauge_t lightnessGauge		=	{	.gauge_handle		= &hadc3, 
																				.result_dn			= 0x0000, 
																				.gaugeMinScale	= 0x0C };

VCP_Light_Reply_t vcp_lightdn_reply	=	{	.error_LightW		= 0xffffffff, 
																				.error_LightIR	= 0xffffffff, 
																				.lightnessWDN		= 0xffff, 
																				.lightnessIRDN	= 0xffff };

VCP_SetLed_Reply_t vcp_setLed_reply	= {	.error					= 0xffffffff, 
																				.lightnessDN		= 0xffff };

Gpio_RGB_Led_t led_R = {.gpio_x		= GPIOG, 
												.gpio_pin	= GPIO_PIN_2};

Gpio_RGB_Led_t led_G = {.gpio_x		= GPIOG, 
												.gpio_pin	= GPIO_PIN_3};

Gpio_RGB_Led_t led_B = {.gpio_x		= GPIOG, 
												.gpio_pin	= GPIO_PIN_4};

uint8_t UserTxBuffer[] = "---K1 button clicked--- \n";

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_TIM10_Init(void);
static void MX_TIM11_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI5_Init(void);
static void MX_SPI1_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void vTurnOnRgbLed( uint16_t r, uint16_t g, uint16_t b );
void vTurnOffRgbLed(void);
	
uint16_t vTurnOnLed( Timer_Led_t *ledTimer, uint16_t ucLightness );
uint16_t vTurnOffLed( Timer_Led_t *ledTimer);
uint16_t GetLightness( Lightness_Gauge_t *lightnessGauge );
int8_t VCP_CMD_process( void );
int32_t AutoAdjustLed(Timer_Led_t *ledTimer, Lightness_Gauge_t *lightGauge, uint16_t dn_target);

