fanmuzhi/STM32_ARM/Src/main.c
}

/* USER CODE BEGIN 4 */
uint16_t GetLightness( Lightness_Gauge_t *lightnessGauge )
{
	lightnessGauge->result_dn = 0xffff;
	HAL_ADC_Start(lightnessGauge->gauge_handle);
	HAL_ADC_PollForConversion(lightnessGauge->gauge_handle, 2000);
	lightnessGauge->result_dn = HAL_ADC_GetValue(lightnessGauge->gauge_handle);
	return 0;
}		

/* VCP command processing function*/
int8_t VCP_CMD_process()
{
    if( s_RxBuff.IsCommandDataReceived == 0 )
		{
			return 0; //no data received
		}
    else
		{
			switch(s_RxBuff.UserRxBufferFS[0])
			{
				// process cmd set led by digital number needed, and return light digital number
				case VCP_CMD_SET_LED_DN:
				{
					vcp_lightdn_reply.error_LightW	= 0xffffffff, 
					vcp_lightdn_reply.error_LightIR	= 0xffffffff, 
					vcp_lightdn_reply.lightnessWDN	= 0xffff;
					vcp_lightdn_reply.lightnessIRDN	= 0xffff;
					if(s_RxBuff.UserRxBufferFS[2] >= 0x10 || s_RxBuff.UserRxBufferFS[4] >= 0x10)
					{
						if(s_RxBuff.UserRxBufferFS[2] >= 0x10)
						{
							vcp_lightdn_reply.error_LightW = DN_EXCEEDED;
						}
						if(s_RxBuff.UserRxBufferFS[4] >= 0x10)
						{
							vcp_lightdn_reply.error_LightIR = DN_EXCEEDED;
						}
						CDC_Transmit_FS((uint8_t *)(&vcp_lightdn_reply), sizeof(vcp_lightdn_reply));      //send back the detected light adc value
						break;
					}

					if(s_RxBuff.UserRxBufferFS[4] >= 0x10)
					{
						vcp_lightdn_reply.error_LightIR = DN_EXCEEDED;
						CDC_Transmit_FS((uint8_t *)(&vcp_lightdn_reply), sizeof(vcp_lightdn_reply));      //send back the detected light adc value
						break;
					}
					uint16_t lightnessW_target = (uint16_t)s_RxBuff.UserRxBufferFS[1] + (((uint16_t)s_RxBuff.UserRxBufferFS[2])<<8);
					uint16_t lightnessIR_target = (uint16_t)s_RxBuff.UserRxBufferFS[3] + (((uint16_t)s_RxBuff.UserRxBufferFS[4])<<8);
					
					//adjust IR Led to lightnessIR_target
					vTurnOffLed(&led_W);
					HAL_Delay(200);
//				vTurnOffLed(&led_IR);
					if (AutoAdjustLed(&led_IR, &lightnessGauge, lightnessIR_target) == -2)
					{
						vcp_lightdn_reply.error_LightIR = ADJUST_TO_TARGET_FAIL;
					}
					else
					{
						vcp_lightdn_reply.error_LightIR = lightnessGauge.gauge_handle->ErrorCode;
					}
					vcp_lightdn_reply.lightnessIRDN = lightnessGauge.result_dn;
					
					//adjust W Led to lightness_target
//				vTurnOffLed(&led_W);
					vTurnOffLed(&led_IR);
					HAL_Delay(200);
					if (AutoAdjustLed(&led_W, &lightnessGauge, lightnessW_target) == -2)
					{
						vcp_lightdn_reply.error_LightW = ADJUST_TO_TARGET_FAIL;
					}
					else
					{
						vcp_lightdn_reply.error_LightW = lightnessGauge.gauge_handle->ErrorCode;
					}
					vcp_lightdn_reply.lightnessWDN = lightnessGauge.result_dn;
					vTurnOnLed(&led_W, led_W.last_led_tim_val);		//re-light on IR LED again 
					vTurnOnLed(&led_IR, led_IR.last_led_tim_val);		//re-light on IR LED again 

					CDC_Transmit_FS((uint8_t *)(&vcp_lightdn_reply), sizeof(vcp_lightdn_reply));      //send back the detected light adc value
					break;
				}
				
				
				case VCP_CMD_SET_LED_TIM:						//process cmd set led lightness by timer number, and return light digital number
				{
					if(s_RxBuff.UserRxBufferFS[2] >= 0x10 || s_RxBuff.UserRxBufferFS[4] >= 0x10)
					{
						vcp_setLed_reply.error = DN_EXCEEDED;
						CDC_Transmit_FS((uint8_t *)(&vcp_lightdn_reply), sizeof(vcp_lightdn_reply));      //send back the detected light adc value
						break;
					}
					vTurnOnLed(&led_W, (uint16_t)s_RxBuff.UserRxBufferFS[1] + (((uint16_t)s_RxBuff.UserRxBufferFS[2])<<8));
					vTurnOnLed(&led_IR, (uint16_t)s_RxBuff.UserRxBufferFS[3] + (((uint16_t)s_RxBuff.UserRxBufferFS[4])<<8));
					HAL_Delay(100);
					GetLightness(&lightnessGauge);
					
					vcp_setLed_reply.error = lightnessGauge.gauge_handle->ErrorCode;
					vcp_setLed_reply.lightnessDN = lightnessGauge.result_dn;
					CDC_Transmit_FS( (uint8_t *)(&vcp_setLed_reply), sizeof(vcp_setLed_reply));       //send back the detected light adc value
					break;
				}
				
				
				case VCP_CMD_GET_LED_DN:			// process cmd get led digtal number back , and return light digital number
				{
					GetLightness(&lightnessGauge);
					vcp_setLed_reply.error = lightnessGauge.gauge_handle->ErrorCode;
					vcp_setLed_reply.lightnessDN = lightnessGauge.result_dn;
					CDC_Transmit_FS( (uint8_t *)(&vcp_setLed_reply), sizeof(vcp_setLed_reply));       //send back the detected light adc value
					break;
				}
				
				default:	
					break;
			}
			s_RxBuff.IsCommandDataReceived = 0;
		}
    return 1;
}

//function to auto adjust Led to the dn_target value
int32_t AutoAdjustLed(Timer_Led_t *ledTimer, Lightness_Gauge_t *lightGauge, uint16_t dn_target)
{
	if(dn_target == DN_LED_MIN || dn_target == DN_LED_MAX)
	{
		vTurnOnLed(ledTimer, dn_target);
		HAL_Delay(200);
		GetLightness(lightGauge);
		if (abs(lightGauge->result_dn - dn_target) > lightGauge->gaugeMinScale)
		{
			return -2;
		}
		else
		{
			return 0;
		}
	}
	uint16_t led_low = LED_MIN, led_high = LED_MAX;
	uint8_t count = 0;	
	while (led_low <= led_high) 
	{
		count++;
		if(count >= LIGHT_AUTOADJUST_TIME_MAX)
		{
			return -2;
		}	
		uint16_t led_middle = (led_low + led_high) / 2;
		vTurnOnLed(ledTimer, led_middle);
		HAL_Delay(200);
		GetLightness(lightGauge);
		if (lightGauge->gauge_handle->ErrorCode != 0)
		{
			return -1;
		}
		if (abs(lightGauge->result_dn - dn_target) <= (lightGauge->gaugeMinScale)/2)
		{
			return 0;
		}
		else if (lightGauge->result_dn > dn_target + lightGauge->gaugeMinScale) 
		{
			led_high = led_middle;
		}
		else if(lightGauge->result_dn < dn_target - lightGauge->gaugeMinScale) 
		{
			led_low = led_middle;
		}
	}
	return -1;
}

void vTurnOnRgbLed( uint16_t r, uint16_t g, uint16_t b )
{
		HAL_GPIO_WritePin(led_R.gpio_x, led_R.gpio_pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(led_G.gpio_x, led_G.gpio_pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(led_B.gpio_x, led_B.gpio_pin, GPIO_PIN_SET);
}

void vTurnOffRgbLed(void)
{
		HAL_GPIO_WritePin(led_R.gpio_x, led_R.gpio_pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(led_G.gpio_x, led_G.gpio_pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(led_B.gpio_x, led_B.gpio_pin, GPIO_PIN_RESET);
}

uint16_t vTurnOnLed( Timer_Led_t *ledTimer, uint16_t ucLightness )
{
	if(ucLightness == 0x0000)
	{
		vTurnOffLed(ledTimer);
		return 0;
	}
	ucLightness = (ucLightness > 0xfff)?0xfff:ucLightness;

  TIM_OC_InitTypeDef sConfigOC;             
	sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = (uint32_t)ucLightness;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  HAL_TIM_PWM_ConfigChannel(ledTimer->tim_handle, &sConfigOC, ledTimer->tim_channel);
               
	if(HAL_TIM_PWM_Start(ledTimer->tim_handle, ledTimer->tim_channel) != HAL_OK)
	{
//		ledTimer->last_led_tim_val = 0xffff;
	}
	ledTimer->last_led_tim_val = ucLightness;
	ledTimer->tim_isStarted = 1;
//	HAL_Delay(200);
	return 0;
}

uint16_t vTurnOffLed( Timer_Led_t *ledTimer)
{    
	TIM_OC_InitTypeDef sConfigOC;             
	sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = (uint32_t)0x00000000;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
  HAL_TIM_PWM_ConfigChannel(ledTimer->tim_handle, &sConfigOC, ledTimer->tim_channel);
               
	if(HAL_TIM_PWM_Start(ledTimer->tim_handle, ledTimer->tim_channel) != HAL_OK)
	{
//		ledTimer->last_led_tim_val = 0xffff;
	}

	if(HAL_TIM_PWM_Stop(ledTimer->tim_handle, ledTimer->tim_channel) != HAL_OK)
	{
		
